# W1M2 - SQL Tutorial

#### 학습 목표
SQL의 기초에 대해서 공부합니다.
Tutorial의 Home에서부터 Operators까지 읽고 Example을 실행합니다.
Jupyter Notebook에서 SQL을 사용해서 데이터를 처리하는 것을 공부합니다.

#### 기능요구사항
Jupyter Notebook을 만듭니다.
SQL Tutorials에서 Example을 하나씩 수행하고 그 결과를 노트북에 출력하세요.
원하는 출력결과를 얻기 위해 필요하다면 적합한 Demo Table을 만들어야 합니다.

#### 프로그래밍 요구사항
sqlite3 라이브러리를 사용하세요

#### pandas와 같은 라이브러리는 사용해서는 안됩니다. SQL 명령어로만 원하는 결과를 얻어야 합니다.

#### 예상결과 및 동작예시
Query의 결과가 출력된 Jupyter notebook을 제출하세요.

#### 팀 활동 요구사항
각자가 이해하기 어려웠던, 또는 이해하지 못한 keyword에 대해서 함께 토의해 봅시다. 그 결과를 개인 위키에 기록하세요.

---

# SQL Tutorial Example

In [13]:

import sqlite3

conn = sqlite3.connect('./M2.db')
cur = conn.cursor()
sql = open('/Users/admin/Documents/GitHub/Daily_Softeer/Missions/Week1/W1M2/hjw_sql.sql', 'r').read()

# init db
cur.executescript(sql)

# 6줄만 나오도록 제한
# def print_query(query, limit=6):
#     cur.execute(query)
#     print(query)
#     i = 0
#     for row in cur:
#         if i >= limit:
#             print('...')
#             break
#         print(row)
#         i += 1
#     print('-' * 50)
    

def print_query(query, limit=6):
    """Execute a query and print the result with an optional limit."""
    cur.execute(query)
    results = cur.fetchall()
    
    # 프린트 줄의 제한
    print("Query Results:")
    for idx, row in enumerate(results):
        if idx >= limit:
            print(f"...and {len(results) - limit} more rows.")
            break
        print(row)
    
    # Calculate and print the total rows if no limit is applied
    if limit:
        print(f"Total rows (if limit is removed): {len(results)}")
    
    print('-' * 50)

#### SQL SELECT Statement

In [14]:
print_query('SELECT * FROM Customers')

Query Results:
(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany')
(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico')
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico')
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
(5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')
(6, 'Blauer See Delikatessen', 'Hanna Moos', 'Forsterstr. 57', 'Mannheim', '68306', 'Germany')
...and 85 more rows.
Total rows (if limit is removed): 91
--------------------------------------------------

In [15]:
print_query('SELECT Address FROM Customers')

Query Results:
('Obere Str. 57',)
('Avda. de la Constitución 2222',)
('Mataderos 2312',)
('120 Hanover Sq.',)
('Berguvsvägen 8',)
('Forsterstr. 57',)
...and 85 more rows.
Total rows (if limit is removed): 91
--------------------------------------------------

#### SQL SELECT DISTINCT

In [17]:
print_query('SELECT DISTINCT Country FROM Customers')
print_query('SELECT Country FROM Customers')
print_query('SELECT COUNT(DISTINCT Country) FROM Customers')

Query Results:
('Germany',)
('Mexico',)
('UK',)
('Sweden',)
('France',)
('Spain',)
...and 15 more rows.
Total rows (if limit is removed): 21
--------------------------------------------------
Query Results:
('Germany',)
('Mexico',)
('Mexico',)
('UK',)
('Sweden',)
('Germany',)
...and 85 more rows.
Total rows (if limit is removed): 91
--------------------------------------------------
Query Results:
(21,)
Total rows (if limit is removed): 1
--------------------------------------------------

#### SQL WHERE

In [20]:
WHERE_query_1 = '''
              SELECT * FROM Customers
              WHERE Country="Mexico"
              '''
print_query(WHERE_query_1)

WHERE_query_2 = '''
              SELECT * FROM Customers
              WHERE CustomerID=1;
              '''
print_query(WHERE_query_2)

WHERE_query_3 = '''
              SELECT * FROM Customers
              WHERE CustomerID > 80
              '''
print_query(WHERE_query_3)

Query Results:
(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico')
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico')
(13, 'Centro comercial Moctezuma', 'Francisco Chang', 'Sierras de Granada 9993', 'México D.F.', '5022', 'Mexico')
(58, 'Pericles Comidas clásicas', 'Guillermo Fernández', 'Calle Dr. Jorge Cash 321', 'México D.F.', '5033', 'Mexico')
(80, 'Tortuga Restaurante', 'Miguel Angel Paolino', 'Avda. Azteca 123', 'México D.F.', '5033', 'Mexico')
Total rows (if limit is removed): 5
--------------------------------------------------
Query Results:
(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany')
Total rows (if limit is removed): 1
--------------------------------------------------
Query Results:
(81, 'Tradição Hipermercados', 'Anabela Domingues', 'Av. Inês de Castro, 414', 'São Paulo', '05634-030', 'Brazil')
(82, "Trail''s Head Gourmet Provisioners", 'Helvetius Nagy', '722 DaVinci Blvd.', 'Kirkland', '98034', 'USA')
(83, 'Vaffeljernet', 'Palle Ibsen', 'Smagsløget 45', 'Århus', '8200', 'Denmark')
(84, 'Victuailles en stock', 'Mary Saveley', '2, rue du Commerce', 'Lyon', '69004', 'France')
(85, 'Vins et alcools Chevalier', 'Paul Henriot', "59 rue de l''Abbaye", 'Reims', '51100', 'France')
(86, 'Die Wandernde Kuh', 'Rita Müller', 'Adenauerallee 900', 'Stuttgart', '70563', 'Germany')
...and 5 more rows.
Total rows (if limit is removed): 11
--------------------------------------------------

#### SQL ORDER BY

In [26]:
ORDER_BY_query = '''
SELECT * FROM Products
ORDER BY Price
'''
                 
print_query(ORDER_BY_query)


ORDER_BY_DESC_query = '''
SELECT * FROM Products
ORDER BY Price DESC
'''
                 
print_query(ORDER_BY_DESC_query)


# Alphabetically
ORDER_BY_Alp = ''' 
SELECT * FROM Products
ORDER BY ProductName
'''
print_query(ORDER_BY_Alp)

Query Results:
(33, 'Geitost', 15, 4, '500 g', 2.5)
(24, 'Guaraná Fantástica', 10, 1, '12 - 355 ml cans', 4.5)
(13, 'Konbu', 6, 8, '2 kg box', 6)
(52, 'Filo Mix', 24, 5, '16 - 2 kg boxes', 7)
(54, 'Tourtière', 25, 6, '16 pies', 7.45)
(75, 'Rhönbräu Klosterbier', 12, 1, '24 - 0.5 l bottles', 7.75)
...and 71 more rows.
Total rows (if limit is removed): 77
--------------------------------------------------
Query Results:
(38, 'Côte de Blaye', 18, 1, '12 - 75 cl bottles', 263.5)
(29, 'Thüringer Rostbratwurst', 12, 6, '50 bags x 30 sausgs.', 123.79)
(9, 'Mishi Kobe Niku', 4, 6, '18 - 500 g pkgs.', 97)
(20, "Sir Rodney's Marmalade", 8, 3, '30 gift boxes', 81)
(18, 'Carnarvon Tigers', 7, 8, '16 kg pkg.', 62.5)
(59, 'Raclette Courdavault', 28, 4, '5 kg pkg.', 55)
...and 71 more rows.
Total rows (if limit is removed): 77
--------------------------------------------------
Query Results:
(17, 'Alice Mutton', 7, 6, '20 - 1 kg tins', 39)
(3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10)
(40, 'Boston Crab Meat', 19, 8, '24 - 4 oz tins', 18.4)
(60, 'Camembert Pierrot', 28, 4, '15 - 300 g rounds', 34)
(18, 'Carnarvon Tigers', 7, 8, '16 kg pkg.', 62.5)
(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18)
...and 71 more rows.
Total rows (if limit is removed): 77
--------------------------------------------------

In [28]:
# ORDER BY Several Columns
ORDER_BY_sev = ''' 
SELECT * FROM Customers
ORDER BY Country ASC, CustomerName DESC
'''
print_query(ORDER_BY_sev)

Query Results:
(64, 'Rancho grande', 'Sergio Gutiérrez', 'Av. del Libertador 900', 'Buenos Aires', '1010', 'Argentina')
(54, 'Océano Atlántico Ltda.', 'Yvonne Moncada', 'Ing. Gustavo Moncada 8585 Piso 20-A', 'Buenos Aires', '1010', 'Argentina')
(12, 'Cactus Comidas para llevar', 'Patricio Simpson', 'Cerrito 333', 'Buenos Aires', '1010', 'Argentina')
(59, 'Piccolo und mehr', 'Georg Pipps', 'Geislweg 14', 'Salzburg', '5020', 'Austria')
(20, 'Ernst Handel', 'Roland Mendel', 'Kirchgasse 6', 'Graz', '8010', 'Austria')
(76, 'Suprêmes délices', 'Pascale Cartrain', 'Boulevard Tirou, 255', 'Charleroi', 'B-6000', 'Belgium')
...and 85 more rows.
Total rows (if limit is removed): 91
--------------------------------------------------

#### SQL AND

**AND vs OR**  
AND	모든 조건이 TRUE일 경우 레코드 반환	(모든 조건 만족해야)  
OR	하나 이상의 조건이 TRUE일 경우 레코드 반환 (하나만 만족)

In [35]:
AND_qu = ''' 
SELECT *
FROM Customers
WHERE Country = "Spain" AND CustomerName LIKE "G%"
'''
print_query(AND_qu)


AND_qu = ''' 
SELECT * FROM Customers
WHERE Country = 'Germany'
AND City = 'Berlin'
AND PostalCode > 12000
'''
print_query(AND_qu)

# 괄호를 사용하여 연산의 우선순위를 명확히 지정해야 올바른 결과를 얻을 수 있다
AND_qu = ''' 
SELECT * FROM Customers
WHERE Country = 'Spain' AND (CustomerName LIKE 'G%' OR CustomerName LIKE 'R%')
'''
print_query(AND_qu)


AND_qu = ''' 
SELECT * FROM Customers
WHERE Country = 'Spain' AND CustomerName LIKE 'G%' OR CustomerName LIKE 'R%'
'''
print_query(AND_qu)

Query Results:
(29, 'Galería del gastrónomo', 'Eduardo Saavedra', 'Rambla de Cataluña, 23', 'Barcelona', '8022', 'Spain')
(30, 'Godos Cocina Típica', 'José Pedro Freyre', 'C/ Romero, 33', 'Sevilla', '41101', 'Spain')
Total rows (if limit is removed): 2
--------------------------------------------------
Query Results:
(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany')
Total rows (if limit is removed): 1
--------------------------------------------------
Query Results:
(29, 'Galería del gastrónomo', 'Eduardo Saavedra', 'Rambla de Cataluña, 23', 'Barcelona', '8022', 'Spain')
(30, 'Godos Cocina Típica', 'José Pedro Freyre', 'C/ Romero, 33', 'Sevilla', '41101', 'Spain')
(69, 'Romero y tomillo', 'Alejandra Camino', 'Gran Vía, 1', 'Madrid', '28001', 'Spain')
Total rows (if limit is removed): 3
--------------------------------------------------
Query Results:
(29, 'Galería del gastrónomo', 'Eduardo Saavedra', 'Rambla de Cataluña, 23', 'Barcelona', '8022', 'Spain')
(30, 'Godos Cocina Típica', 'José Pedro Freyre', 'C/ Romero, 33', 'Sevilla', '41101', 'Spain')
(64, 'Rancho grande', 'Sergio Gutiérrez', 'Av. del Libertador 900', 'Buenos Aires', '1010', 'Argentina')
(65, 'Rattlesnake Canyon Grocery', 'Paula Wilson', '2817 Milton Dr.', 'Albuquerque', '87110', 'USA')
(66, 'Reggiani Caseifici', 'Maurizio Moroni', 'Strada Provinciale 124', 'Reggio Emilia', '42100', 'Italy')
(67, 'Ricardo Adocicados', 'Janete Limeira', 'Av. Copacabana, 267', 'Rio de Janeiro', '02389-890', 'Brazil')
...and 2 more rows.
Total rows (if limit is removed): 8
--------------------------------------------------